In [7]:
import sqlite3
import pandas as pd

In [8]:
con = sqlite3.connect('DBname.db')

In [9]:
task1 = pd.read_sql("""

    SELECT DISTINCT Employee
    FROM EmployeePoints

""", con)

In [10]:
# Напишите SELECT, который выводит список уникальных имен сотрудников.

task1

  Employee
0     Маша
1     Петя
2     Вася
3     Саша
4   Максим

In [11]:
task2 = pd.read_sql("""

    SELECT Employee, 
    COUNT(Point) AS 'Number of 5s'
    FROM EmployeePoints
    WHERE Point = '5'
    GROUP BY Employee
    ORDER BY 'Number of 5s' ASC

""", con)

In [12]:
# Напишите SELECT, который выводит список сотрудников, упорядоченный по количеству полученных оценок "5", начиная с сотрудника, который получил их максимальное количество.

task2

  Employee  Number of 5s
0     Маша             3
1     Саша             2